HELPTEXT =  '''                    Части речи
S — существительное (яблоня, лошадь, корпус, вечность)
A — прилагательное (коричневый, таинственный, морской)
NUM — числительное (четыре, десять, много)
A-NUM — числительное-прилагательное (один, седьмой, восьмидесятый)
V — глагол (пользоваться, обрабатывать)
ADV — наречие (сгоряча, очень)
PRAEDIC — предикатив (жаль, хорошо, пора)
PARENTH — вводное слово (кстати, по-моему)
S-PRO — местоимение-существительное (она, что)
A-PRO — местоимение-прилагательное (который, твой)
ADV-PRO — местоименное наречие (где, вот)
PRAEDIC-PRO — местоимение-предикатив (некого, нечего)
PR — предлог (под, напротив)
CONJ — союз (и, чтобы)
PART — частица (бы, же, пусть)
INTJ — междометие (увы, батюшки) 

        Значения грамматических категорий:
    Род:
m — мужской род (работник, стол)
f — женский род (работница, табуретка)
m-f — «общий род» (задира, пьяница)
n — средний род (животное, озеро)
   
    Одушевленность:
anim — одушевленность (человек, ангел, утопленник)
inan — неодушевленность (рука, облако, культура)
   
    Число:
sg — единственное число (яблоко, гордость)
pl — множественное число (яблоки, ножницы, детишки)
    
    Падеж:
nom — именительный падеж (голова, сын, степь, сани, который)
gen — родительный падеж (головы, сына, степи, саней, которого)
dat — дательный падеж (голове, сыну, степи, саням, которому) 
acc — винительный падеж (голову, сына, степь, сани, который/которого)
ins — творительный падеж (головой, сыном, степью, санями, которым)
loc — предложный падеж ([о] голове, сыне, степи, санях, котором)
gen2 — второй родительный падеж (чашка чаю)
acc2 — второй винительный падеж (постричься в монахи; по два человека)
loc2 — второй предложный падеж (в лесу, на оси)
voc — звательная форма (Господи, Серёж, ребят)
adnum — счётная форма (два часа, три шара)
   
    Краткая/полная форма:
brev — краткая форма (высок, нежна, прочны, рад)
plen — полная форма (высокий, нежная, прочные, морской)
    
    Степень сравнения:
comp — сравнительная степень (глубже)
comp2 — форма «по+сравнительная степень» (поглубже)
supr — превосходная степень (глубочайший)
   
    Вид:
pf — совершенный вид (пошёл, встречу)
ipf — несовершенный вид (ходил, встречаю)
    Переходность:
intr — непереходность (ходить, вариться)
tran — переходность (вести, варить)
    
    Залог:
act — действительный залог (разрушил, разрушивший)
pass — страдательный залог (только у причастий: разрушаемый, разрушенный)
med — медиальный, или средний залог (глагольные формы на -ся: разрушился и т.п.)
    
    Форма (репрезентация) глагола:
inf — инфинитив (украшать)
partcp — причастие (украшенный)
ger — деепричастие (украшая)
   
    Наклонение:
indic — изъявительное наклонение (украшаю, украшал, украшу)
imper — повелительное наклонение (украшай)
imper2 — форма повелительного наклонения 1 л. мн. ч. на -те (идемте)
   
    Время:
praet — прошедшее время (украшали, украшавший, украсив)
praes — настоящее время (украшаем, украшающий, украшая)
fut — будущее время (украсим)
    Лицо:
1p — первое лицо (украшаю)
2p — второе лицо (украшаешь)
3p — третье лицо (украшает)
    Прочие признаки:
persn — личное имя (Иван, Дарья, Леопольд, Эстер, Гомер, Маугли)
patrn — отчество (Иванович, Павловна) 
famn — фамилия (Николаев, Волконская, Гумбольдт)
zoon — кличка животного (Шарик, Дочка)
0 — несклоняемое (шоссе, Седых) 
'''
